Ran Plan for 5 projects:

1. project: `terraform-demo1` dir: `terraform/demo/demo1` workspace: `default`
1. project: `terraform-demo2` dir: `terraform/demo/demo2` workspace: `default`
1. project: `terraform-test-labels` dir: `terraform/test-labels` workspace: `default`
1. project: `terraform-dso-tmp` dir: `terraform/dso/tmp` workspace: `default`
1. project: `terragrunt-dso-tmp` dir: `terragrunt/dso/terragrunt-tmp` workspace: `default`

### 1. project: `terraform-demo1` dir: `terraform/demo/demo1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.demo will be created
+ resource "null_resource" "demo" {
      + id = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-demo1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://18.178.60.96:4141/lock?id=Cinnamon%252Fatlantis-example%252Fterraform%252Fdemo%252Fdemo1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-demo1`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `terraform-demo2` dir: `terraform/demo/demo2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.demo will be created
+ resource "null_resource" "demo" {
      + id = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-demo2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://18.178.60.96:4141/lock?id=Cinnamon%252Fatlantis-example%252Fterraform%252Fdemo%252Fdemo2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-demo2`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. project: `terraform-test-labels` dir: `terraform/test-labels` workspace: `default`
<details><summary>Show Output</summary>

```diff

Changes to Outputs:
+ tags = {
      + "Manage by"    = "dso@cinnamon.is"
      + "Name"         = "dev-dso-app"
      + "Product"      = "dso"
      + "Project_code" = "abc"
      + "Stage"        = "dev"
      + "Tenant"       = "test"
      + "Terraform"    = "true"
    }

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-test-labels`
* :put_litter_in_its_place: To **delete** this plan click [here](http://18.178.60.96:4141/lock?id=Cinnamon%252Fatlantis-example%252Fterraform%252Ftest-labels%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-test-labels`
</details>


---
### 4. project: `terraform-dso-tmp` dir: `terraform/dso/tmp` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ec2-instance.aws_eip.eip[0] will be created
+ resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + tags_all             = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.ec2-instance.aws_eip_association.eip_assoc[0] will be created
+ resource "aws_eip_association" "eip_assoc" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.ec2-instance.aws_instance.instance[0] will be created
+ resource "aws_instance" "instance" {
      + ami                                  = "ami-04204a8960917fd92"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-northeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3a.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops-02-march-2022"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-3430b17c"
      + tags                                 = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "I2Nsb3VkLWNvbmZpZwpwYWNrYWdlX3VwZ3JhZGU6IHRydWUKcnVuY21kOgogIC0gc3VkbyBjdXJsIC1MICJodHRwczovL2dpdGh1Yi5jb20vZG9ja2VyL2NvbXBvc2UvcmVsZWFzZXMvZG93bmxvYWQvMS4yNS40L2RvY2tlci1jb21wb3NlLSQodW5hbWUgLXMpLSQodW5hbWUgLW0pIiAtbyAvdXNyL2xvY2FsL2Jpbi9kb2NrZXItY29tcG9zZQogIC0gc3VkbyBjaG1vZCAreCAvdXNyL2xvY2FsL2Jpbi9kb2NrZXItY29tcG9zZQogIC0gY3VybCAiaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAiIC1vICJhd3NjbGl2Mi56aXAiCiAgLSB1bnppcCBhd3NjbGl2Mi56aXAKICAtIHN1ZG8gLi9hd3MvaW5zdGFsbApwb3dlcl9zdGF0ZToKICBtb2RlOiByZWJvb3QKICBtZXNzYWdlOiBSZXN0YXJ0aW5nIGFmdGVyIGluc3RhbGxpbmcgZG9ja2VyLWNvbXBvc2U="
      + volume_tags                          = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2-instance.module.security_group.aws_security_group.security_group[0] will be created
+ resource "aws_security_group" "security_group" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tmp-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp-sg"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Manage by" = "dso@cinnamon.is"
          + "Name"      = "dso-tmp-sg"
          + "Product"   = "dso"
          + "Terraform" = "true"
        }
      + vpc_id                 = "vpc-c4f83fa2"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ec2-instance.module.security_group.aws_security_group_rule.egress_rules[0] will be created
+ resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.ec2-instance.module.security_group.aws_security_group_rule.ingress_rules[0] will be created
+ resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-dso-tmp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://18.178.60.96:4141/lock?id=Cinnamon%252Fatlantis-example%252Fterraform%252Fdso%252Ftmp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-dso-tmp`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
### 5. project: `terragrunt-dso-tmp` dir: `terragrunt/dso/terragrunt-tmp` workspace: `default`
**Plan Error**
```
exit status 1: running "terragrunt plan -out=$PLANFILE" in "/root/.atlantis/repos/Cinnamon/atlantis-example/3/default/terragrunt/dso/terragrunt-tmp": 
time=2022-03-18T06:54:24Z level=error msg=exec: "terraform1.1.7": executable file not found in $PATH
time=2022-03-18T06:54:24Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
